Autodesk.Revit.DB.TagByExampleOptions.MatchExampleLocation
If true, only the translation from the example host to target host is applied to the new tag.  Rotations and mirroring are ignored.
If false, all of the transformations and mirroring required to get from the example host to the target host will be applied to the new tag.

Autodesk.Revit.DB.TagByExampleOptions.#ctor
Constructor for TagByExampleOptions.

Autodesk.Revit.DB.TagByExampleOptions
Options for Tag by Example